tutorials/compressible/rhoPorousSimpleFoam/beaverJoseph/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 0 -0.1)
    (8 0 -0.1)
    (8 1 -0.1)
    (0 1 -0.1)
    (0 0 0.1)
    (8 0 0.1)
    (8 1 0.1)
    (0 1 0.1)
    (0 2 -0.1)
    (8 2 -0.1)
    (0 2 0.1)
    (8 2 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) poro (100 20 1) simpleGrading (1 1 1)
    hex (3 2 9 8 7 6 11 10) air (100 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (3 7 10 8)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
            (6 2 9 11)
        );
    }

    upperWall
    {
        type wall;
        faces
        (
            (8 9 11 10)
        );
    }

    lowerWall
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (2 3 8 9)
            (6 7 10 11)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
